Revit 2026 API

# RoomUnboundedHeight Property

---

Get the Unbounded Height of the Room.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double UnboundedHeight { get; }
```
```vb
Public ReadOnly Property UnboundedHeight As Double
	Get
```
```cpp
public:
property double UnboundedHeight {
	double get ();
}
```
```fsharp
member UnboundedHeight : float with get
```

#### Property Value

Double

This property is used to get the Unbounded Height of the Room.

#### Reference

Room Class

Autodesk.Revit.DB.Architecture Namespace